IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_ECAP3_CONTROLSS_ECAP3.xml
<module name="CONTROLSS_ECAP3_CONTROLSS_ECAP3" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CONTROLSS_ECAP3_TSCTR" acronym="CONTROLSS_ECAP3_TSCTR" offset="0x0" width="32" description="">
		<bitfield id="TSCTR" width="32" begin="31" end="0" resetval="0x0" description="Active 32-bit counter register that is used as the capture time-base HR mode : 1)  This register reads HRCOUNTER value and is not writable 2)  can be reset using CTRFILTRESET 3)  Its not  synchronized to SYSCLK domain so reads may not be accurate" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP3_CTRPHS" acronym="CONTROLSS_ECAP3_CTRPHS" offset="0x4" width="32" description="">
		<bitfield id="CTRPHS" width="32" begin="31" end="0" resetval="0x0" description="Counter phase value register that can be programmed for phase lag/lead. This register CTRPHS is loaded into TSCTR upon either a SYNCI event or S/W force via a control bit. Used to achieve phase control synchronization with respect to other eCAP and EPWM time-bases.  This register is not applicable in HR mode." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP3_CAP1" acronym="CONTROLSS_ECAP3_CAP1" offset="0x8" width="32" description="">
		<bitfield id="CAP1" width="32" begin="31" end="0" resetval="0x0" description="This register can be loaded (written) by: - Time-Stamp counter value (TSCTR) during a capture event - Software - may be useful for test purposes or initialization - ARPD shadow register (CAP3) when used in APWM mode" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP3_CAP2" acronym="CONTROLSS_ECAP3_CAP2" offset="0xC" width="32" description="">
		<bitfield id="CAP2" width="32" begin="31" end="0" resetval="0x0" description="This register can be loaded (written) by: - Time-Stamp ( counter value) during a capture event - Software - may be useful for test purposes - ACMP shadow register (CAP4) when used in APWM mode" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP3_CAP3" acronym="CONTROLSS_ECAP3_CAP3" offset="0x10" width="32" description="">
		<bitfield id="CAP3" width="32" begin="31" end="0" resetval="0x0" description="In CMP mode, this is a time-stamp capture register.   In APWM mode, this is the period shadow (APRD) register. You can update the PWM period value through this register. CAP3 (APRD) shadows CAP1 in this mode." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP3_CAP4" acronym="CONTROLSS_ECAP3_CAP4" offset="0x14" width="32" description="">
		<bitfield id="CAP4" width="32" begin="31" end="0" resetval="0x0" description="In CMP mode, this is a time-stamp capture register.   In APWM mode, this is the compare shadow (ACMP) register. You can update the PWM compare value via this register. CAP4 (ACMP) shadows CAP2 in this mode." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP3_ECCTL0" acronym="CONTROLSS_ECAP3_ECCTL0" offset="0x24" width="32" description="">
		<bitfield id="SOCEVTSEL" width="2" begin="17" end="16" resetval="0x0" description="ADC SOC event select  Capture Mode: 00b (R/W) = SOC trigger source is CEVT1 01b (R/W) = SOC trigger source is CEVT2 10b (R/W) = SOC trigger source is CEVT3 11b (R/W) = SOC trigger source is CEVT4  APWM Mode: 00b (R/W) = SOC trigger interrupt source is period match 01b (R/W) = SOC trigger interrupt source is compare match 10b (R/W) = SOC trigger interrupt source is period match or compare match 11b (R/W) = Disabled" range="17 - 16" rwaccess="RW"/> 
		<bitfield id="QUALPRD" width="4" begin="15" end="12" resetval="0x0" description="Qual period to filter out noise on input signals being monitored, Not applicable for HR mode. 0x0 : Bypass 0x1 : pulses of with 1 cycle or less will be filtered out 0x2 : pulses of with 2 cycles or less will be filtered out .... 0xF : pulses of with 15 cycles or less will be filtered out" range="15 - 12" rwaccess="RW"/> 
		<bitfield id="INPUTSEL" width="8" begin="7" end="0" resetval="0x255" description="Capture input source select bits 0x0 capture input is ECAPxINPUT[0]  0x1 capture input is ECAPxINPUT[1]  0x2 capture input is ECAPxINPUT[2] ...  0xFF capture input is ECAPxINPUT[256]" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP3_ECCTL1" acronym="CONTROLSS_ECAP3_ECCTL1" offset="0x28" width="16" description="">
		<bitfield id="FREE_SOFT" width="2" begin="15" end="14" resetval="0x0" description="Emulation Control    0x0   |   ECAP_STOP_EMUTSCTR counter stops immediately on emulation suspend      0x1   |   ECAP_RUNS_UNTILTSCTR counter runs until = 0      0x2   |   ECAP_UNAF_EMU_SUSTSCTR counter is unaffected by emulation suspend (Run Free)      0x3   |   ECAP_UNAF_EMU_SUS2TSCTR counter is unaffected by emulation suspend (Run Free)  " range="15 - 14" rwaccess="RW"/> 
		<bitfield id="PRESCALE" width="5" begin="13" end="9" resetval="0x0" description="Event Filter prescale select    0x00   |   ECAP_DIV1Divide by 1 (i.e,. no prescale, by-pass the prescaler)      0x01   |   ECAP_DIV2Divide by 2      0x02   |   ECAP_DIV4Divide by 4      0x03   |   ECAP_DIV6Divide by 6      0x04   |   ECAP_DIV8Divide by 8      0x05   |   ECAP_DIV10Divide by 10      0x1E   |   ECAP_DIV60Divide by 60      0x1F   |   ECAP_DIV62Divide by 62  " range="13 - 9" rwaccess="RW"/> 
		<bitfield id="CAPLDEN" width="1" begin="8" end="8" resetval="0x0" description="Enable Loading of CAP1-4 registers on a capture event. Note that this bit does not disable CEVTn events from being generated.    0   |   ECAP_DISABLEDisable CAP1-4 register loads at capture event time.      1   |   ECAP_ENABLEEnable CAP1-4 register loads at capture event time.  " range="8" rwaccess="RW"/> 
		<bitfield id="CTRRST4" width="1" begin="7" end="7" resetval="0x0" description="Counter Reset on Capture Event 4    0   |   ECAP_DO_NOT_RESET_EVENT4Do not reset counter on Capture Event 4 (absolute time stamp operation)      1   |   ECAP_RESET_EVENT4Reset counter after Capture Event 4 time-stamp has been captured (used in difference mode operation)  " range="7" rwaccess="RW"/> 
		<bitfield id="CAP4POL" width="1" begin="6" end="6" resetval="0x0" description="Capture Event 4 Polarity select    0   |   ECAP_CAP_EVENT4_RISECapture Event 4 triggered on a rising edge (RE)      1   |   ECAP_CAP_EVENT4_FALLCapture Event 4 triggered on a falling edge (FE)  " range="6" rwaccess="RW"/> 
		<bitfield id="CTRRST3" width="1" begin="5" end="5" resetval="0x0" description="Counter Reset on Capture Event 3    0   |   ECAP_DO_NOT_RESET_EVENT3Do not reset counter on Capture Event 3 (absolute time stamp)      1   |   ECAP_RESET_EVENT3Reset counter after Event 3 time-stamp has been captured (used in difference mode operation)  " range="5" rwaccess="RW"/> 
		<bitfield id="CAP3POL" width="1" begin="4" end="4" resetval="0x0" description="Capture Event 3 Polarity select    0   |   ECAP_CAP_EVENT3_RISECapture Event 3 triggered on a rising edge (RE)      1   |   ECAP_CAP_EVENT3_FALLCapture Event 3 triggered on a falling edge (FE)  " range="4" rwaccess="RW"/> 
		<bitfield id="CTRRST2" width="1" begin="3" end="3" resetval="0x0" description="Counter Reset on Capture Event 2    0   |   ECAP_DO_NOT_RESET_EVENT2Do not reset counter on Capture Event 2 (absolute time stamp)      1   |   ECAP_RESET_EVENT2Reset counter after Event 2 time-stamp has been captured (used in difference mode operation)  " range="3" rwaccess="RW"/> 
		<bitfield id="CAP2POL" width="1" begin="2" end="2" resetval="0x0" description="Capture Event 2 Polarity select    0   |   ECAP_CAP_EVENT2_RISECapture Event 2 triggered on a rising edge (RE)      1   |   ECAP_CAP_EVENT2_FALLCapture Event 2 triggered on a falling edge (FE)  " range="2" rwaccess="RW"/> 
		<bitfield id="CTRRST1" width="1" begin="1" end="1" resetval="0x0" description="Counter Reset on Capture Event 1    0   |   ECAP_DO_NOT_RESET_EVENT1Do not reset counter on Capture Event 1 (absolute time stamp)      1   |   ECAP_RESET_EVENT1Reset counter after Event 1 time-stamp has been captured (used in difference mode operation)  " range="1" rwaccess="RW"/> 
		<bitfield id="CAP1POL" width="1" begin="0" end="0" resetval="0x0" description="Capture Event 1 Polarity select    0   |   ECAP_CAP_EVENT1_RISECapture Event 1 triggered on a rising edge (RE)      1   |   ECAP_CAP_EVENT1_FALLCapture Event 1 triggered on a falling edge (FE)  " range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP3_ECCTL2" acronym="CONTROLSS_ECAP3_ECCTL2" offset="0x2A" width="16" description="">
		<bitfield id="MODCNTRSTS" width="2" begin="15" end="14" resetval="0x0" description="This bit field reads current status on modulo counter 00b (R) = CAP1 register gets loaded on next capture event. 01b (R) = CAP2 register gets loaded on next capture event. 10b (R) = CAP3 register gets loaded on next capture event. 11b (R) = CAP4 register gets loaded on next capture event." range="15 - 14" rwaccess="RW"/> 
		<bitfield id="DMAEVTSEL" width="2" begin="13" end="12" resetval="0x0" description="DMA event select  Capture Mode: 00b (R/W) = DMA interrupt source is CEVT1 01b (R/W) = DMA interrupt source is CEVT2 10b (R/W) = DMA interrupt source is CEVT3 11b (R/W) = DMA interrupt source is CEVT4  APWM Mode: 00b (R/W) = DMA interrupt source is period match 01b (R/W) = DMA interrupt source is compare match 10b (R/W) = DMA interrupt source is period match or compare match 11b (R/W) = Disabled" range="13 - 12" rwaccess="RW"/> 
		<bitfield id="CTRFILTRESET" width="1" begin="11" end="11" resetval="0x0" description="Reset Bit 0h (R) = No effect 1h (W) = Resets event filter, counter, modulo counter and CEVT[1,2,3,4] and CNTOVF , HRERROR flags  Note: This provides an ability start capture module from known state in case spurious inputs are captured while ECAP is configured." range="11" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="APWMPOL" width="1" begin="10" end="10" resetval="0x0" description="APWM output polarity select. This is applicable only in APWM operating mode.    0   |   ECAP_OUTPUT_ACTIVE_HIGHOutput is active high (Compare value defines high time)      1   |   ECAP_OUTPUT_ACTIVE_LOWOutput is active low (Compare value defines low time)  " range="10" rwaccess="RW"/> 
		<bitfield id="CAP_APWM" width="1" begin="9" end="9" resetval="0x0" description="CAP/APWM operating mode select    0   |   ECAP_MODULEECAP module operates in capture mode. This mode forces the following configuration: - Inhibits TSCTR resets via CTR = PRD event - Inhibits shadow loads on CAP1 and 2 registers - Permits user to enable CAP1-4 register load - CAPx/APWMx pin operates as a capture input      1   |   ECAP_MODULE_APWMECAP module operates in APWM mode. This mode forces the following configuration: - Resets TSCTR on CTR = PRD event (period boundary - Permits shadow loading on CAP1 and 2 registers - Disables loading of time-stamps into CAP1-4 registers - CAPx/APWMx pin operates as a APWM output  " range="9" rwaccess="RW"/> 
		<bitfield id="SWSYNC" width="1" begin="8" end="8" resetval="0x0" description="Software-forced Counter (TSCTR) Synchronizer. This provides the user a method to generate a synchronization pulse through software. In APWM mode, the synchronization pulse can also be sourced from the CTR = PRD event.    0   |   ECAP_ZERO_NOEFFECTWriting a zero has no effect. Reading always returns a zero      1   |   ECAP_WRITE_TSCTRWriting a one forces a TSCTR shadow load of current ECAP module and any ECAP modules down-stream providing the SYNCO_SEL bits are 0,0. After writing a 1, this bit returns to a zero. Note: Selection CTR = PRD is meaningful only in APWM mode; however, you can choose it in CAP mode if you find doing so useful.  " range="8" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SYNCO_SEL" width="2" begin="7" end="6" resetval="0x0" description="Sync-Out Select    0x0   |   SWSYNCsync out signal is SWSYNC      0x1   |   ECAP_CTR_PRD_TO_SYNCOUTSelect CTR = PRD event to be the sync-out signal      0x2   |   ECAP_DISABLE_SYNC_OUTDisable sync out signal      0x3   |   ECAP_DISABLE_SYNC_OUTDisable sync out signal  " range="7 - 6" rwaccess="RW"/> 
		<bitfield id="SYNCI_EN" width="1" begin="5" end="5" resetval="0x0" description="Counter (TSCTR) Sync-In select mode    0   |   ECAP_DISABLE_SYNC_INDisable sync-in option      1   |   ECAP_ENABLE_COUNTER_REGISTEREnable counter (TSCTR) to be loaded from CTRPHS register upon either a SYNCI signal or a S/W force event.  " range="5" rwaccess="RW"/> 
		<bitfield id="TSCTRSTOP" width="1" begin="4" end="4" resetval="0x0" description="Time Stamp (TSCTR) Counter Stop (freeze) Control    0   |   ECAP_TSCTR_STOPPEDTSCTR stopped      1   |   ECAP_TSCTR_FREE_RUNNINGTSCTR free-running  " range="4" rwaccess="RW"/> 
		<bitfield id="REARM" width="1" begin="3" end="3" resetval="0x0" description="Re-Arming Control. Note:  The re-arm function is valid in one shot or continuous mode    0   |   ECAP_NO_EFFECT_RETURNS_0Has no effect (reading always returns a 0)      1   |   ECAP_ARMS_ONESHOTArms the one-shot sequence as follows: 1) Resets the Mod4 counter to zero 2) Unfreezes the Mod4 counter 3) Enables capture register loads  " range="3" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="STOP_WRAP" width="2" begin="2" end="1" resetval="0x3" description="Stop value for one-shot mode. This is the number (between 1-4) of captures allowed to occur before the CAP(1-4) registers are frozen, that is, capture sequence is stopped. Wrap value for continuous mode. This is the number (between 1-4) of the capture register in which the circular buffer wraps around and starts again.  Notes: STOP_WRAP is compared to Mod4 counter and, when equal, 2 actions occur: - Mod4 counter is stopped (frozen) - Capture register loads are inhibited In one-shot mode, further interrupt events are blocked until re-armed.    0x0   |   ECAP_STOPEVENT1_WRAPEVENT2Stop after Capture Event 1 in one-shot mode Wrap after Capture Event 1 in continuous mode.      0x1   |   ECAP_STOPEVENT2_WRAPEVENT2Stop after Capture Event 2 in one-shot mode Wrap after Capture Event 2 in continuous mode.      0x2   |   ECAP_STOPEVENT3_WRAPEVENT2Stop after Capture Event 3 in one-shot mode Wrap after Capture Event 3 in continuous mode.      0x3   |   ECAP_STOPEVENT4_WRAPEVENT2Stop after Capture Event 4 in one-shot mode Wrap after Capture Event 4 in continuous mode.  " range="2 - 1" rwaccess="RW"/> 
		<bitfield id="CONT_ONESHT" width="1" begin="0" end="0" resetval="0x0" description="Continuous or one-shot mode control (applicable only in capture mode)    0   |   ECAP_OPP_CONTOperate in continuous mode      1   |   ECAP_OPP_ONEOperate in one-Shot mode  " range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP3_ECEINT" acronym="CONTROLSS_ECAP3_ECEINT" offset="0x2C" width="16" description="">
		<bitfield id="MUNIT_2_ERROR_EVT2" width="1" begin="12" end="12" resetval="0x0" description="Monitoring unit 2 error event 2 interrupt enable 0 : Disable Monitoring unit 2 error event 2 interrupt 1 : Enable Monitoring unit 2 error event 2 interrupt" range="12" rwaccess="RW"/> 
		<bitfield id="MUNIT_2_ERROR_EVT1" width="1" begin="11" end="11" resetval="0x0" description="Monitoring unit 2 error event 2 interrupt enable 0 : Disable Monitoring unit 2 error event 1 interrupt 1 : Enable Monitoring unit 2 error event 1 interrupt" range="11" rwaccess="RW"/> 
		<bitfield id="MUNIT_1_ERROR_EVT2" width="1" begin="10" end="10" resetval="0x0" description="Monitoring unit 1 error event 1 interrupt enable 0 : Disable Monitoring unit 1 error event 2 interrupt 1 : Enable Monitoring unit 1 error event 2 interrupt" range="10" rwaccess="RW"/> 
		<bitfield id="MUNIT_1_ERROR_EVT1" width="1" begin="9" end="9" resetval="0x0" description="Monitoring unit 1 error event 1 interrupt enable 0 : Disable Monitoring unit 1 error event 1 interrupt 1 : Enable Monitoring unit 1 error event 1 interrupt" range="9" rwaccess="RW"/> 
		<bitfield id="HRERROR" width="1" begin="8" end="8" resetval="0x0" description="High resolution error interrupt enable    0   |   ECAP_DISAB_HRERROR_INTERRUPTDisable High Resolution Error as an Interrupt source      1   |   ECAP_ENAB_HRERROR_INTERRUPTEnable High Resolution Error as an Interrupt source  " range="8" rwaccess="RW"/> 
		<bitfield id="CTR_EQ_CMP" width="1" begin="7" end="7" resetval="0x0" description="Counter Equal Compare Interrupt Enable    0   |   ECAP_DISAB_CE_INTERRUPTDisable Compare Equal as an Interrupt source      1   |   ECAP_ENAB_CE_INTERRUPTEnable Compare Equal as an Interrupt source  " range="7" rwaccess="RW"/> 
		<bitfield id="CTR_EQ_PRD" width="1" begin="6" end="6" resetval="0x0" description="Counter Equal Period Interrupt Enable    0   |   ECAP_DISAB_PE_INTERRUPTDisable Period Equal as an Interrupt source      1   |   ECAP_ENAB_PE_INTERRUPTEnable Period Equal as an Interrupt source  " range="6" rwaccess="RW"/> 
		<bitfield id="CTROVF" width="1" begin="5" end="5" resetval="0x0" description="Counter Overflow Interrupt Enable    0   |   ECAP_DISAB_CO_INTERRUPTDisabled counter Overflow as an Interrupt source      1   |   ECAP_ENAB_CO_INTERRUPTEnable counter Overflow as an Interrupt source  " range="5" rwaccess="RW"/> 
		<bitfield id="CEVT4" width="1" begin="4" end="4" resetval="0x0" description="Capture Event 4 Interrupt Enable    0   |   ECAP_DISAB_CAP4_INTERRUPTDisable Capture Event 4 as an Interrupt source      1   |   ECAP_ENAB_CAP4_INTERRUPTCapture Event 4 Interrupt Enable  " range="4" rwaccess="RW"/> 
		<bitfield id="CEVT3" width="1" begin="3" end="3" resetval="0x0" description="Capture Event 3 Interrupt Enable    0   |   ECAP_DISAB_CAP3_INTERRUPTDisable Capture Event 3 as an Interrupt source      1   |   ECAP_ENAB_CAP3_INTERRUPTEnable Capture Event 3 as an Interrupt source  " range="3" rwaccess="RW"/> 
		<bitfield id="CEVT2" width="1" begin="2" end="2" resetval="0x0" description="Capture Event 2 Interrupt Enable    0   |   ECAP_DISAB_CAP2_INTERRUPTDisable Capture Event 2 as an Interrupt source      1   |   ECAP_ENAB_CAP2_INTERRUPTEnable Capture Event 2 as an Interrupt source  " range="2" rwaccess="RW"/> 
		<bitfield id="CEVT1" width="1" begin="1" end="1" resetval="0x0" description="Capture Event 1 Interrupt Enable    0   |   ECAP_DISAB_CAP1_INTERRUPTDisable Capture Event 1 as an Interrupt source      1   |   ECAP_ENAB_CAP1_INTERRUPTEnable Capture Event 1 as an Interrupt source  " range="1" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP3_ECFLG" acronym="CONTROLSS_ECAP3_ECFLG" offset="0x2E" width="16" description="">
		<bitfield id="MUNIT_2_ERROR_EVT2" width="1" begin="12" end="12" resetval="0x0" description="Error event 2 Interrupt Flag from monitoring unit 2" range="12" rwaccess="RO"/> 
		<bitfield id="MUNIT_2_ERROR_EVT1" width="1" begin="11" end="11" resetval="0x0" description="Error event 2 Interrupt Flag from monitoring unit 2" range="11" rwaccess="RO"/> 
		<bitfield id="MUNIT_1_ERROR_EVT2" width="1" begin="10" end="10" resetval="0x0" description="Error event 2 Interrupt Flag from monitoring unit 1" range="10" rwaccess="RO"/> 
		<bitfield id="MUNIT_1_ERROR_EVT1" width="1" begin="9" end="9" resetval="0x0" description="Error event 2 Interrupt Flag from monitoring unit 1" range="9" rwaccess="RO"/> 
		<bitfield id="HRERROR" width="1" begin="8" end="8" resetval="0x0" description="High resolution error status flag    Read0   |   ECAP_INDICATE_NO_EVENTIndicates no event occurred      Read1   |   ECAP_INDICATE_HIGH_RESOLUTION_ERRORIndicates the High resolution Error occurred  " range="8" rwaccess="RO"/> 
		<bitfield id="CTR_CMP" width="1" begin="7" end="7" resetval="0x0" description="Compare Equal Compare Status Flag. This flag is active only in APWM mode.    Read0   |   ECAP_INDICATE_NO_EVENTIndicates no event occurred      Read1   |   ECAP_INDICATE_COUNTER_COMPARE_REGIndicates the counter (TSCTR) reached the compare register value (ACMP)  " range="7" rwaccess="RO"/> 
		<bitfield id="CTR_PRD" width="1" begin="6" end="6" resetval="0x0" description="Counter Equal Period Status Flag. This flag is only active in APWM mode.    Read0   |   ECAP_INDICATE_NO_EVENTIndicates no event occurred      Read1   |   ECAP_INDICATE_PERIOD_VALUE_RESETIndicates the counter (TSCTR) reached the period register value (APRD) and was reset.  " range="6" rwaccess="RO"/> 
		<bitfield id="CTROVF" width="1" begin="5" end="5" resetval="0x0" description="Counter Overflow Status Flag. This flag is active in CAP and APWM mode.    Read0   |   ECAP_INDICATE_NO_EVENTIndicates no event occurred      Read1   |   ECAP_INDICATE_COUNTER_TRANSIndicates the counter (TSCTR) has made the transition from FFFFFFFF to 00000000  " range="5" rwaccess="RO"/> 
		<bitfield id="CEVT4" width="1" begin="4" end="4" resetval="0x0" description="Capture Event 4 Status Flag This flag is only active in CAP mode.    Read0   |   ECAP_INDICATE_NO_EVENTIndicates no event occurred      Read1   |   ECAP_INDICATE_4TH_EVENT_ECAPXIndicates the fourth event occurred at ECAPx pin  " range="4" rwaccess="RO"/> 
		<bitfield id="CEVT3" width="1" begin="3" end="3" resetval="0x0" description="Capture Event 3 Status Flag. This flag is active only in CAP mode.    Read0   |   ECAP_INDICATE_NO_EVENTIndicates no event occurred      Read1   |   ECAP_INDICATE_3RD_EVENT_ECAPXIndicates the third event occurred at ECAPx pin.  " range="3" rwaccess="RO"/> 
		<bitfield id="CEVT2" width="1" begin="2" end="2" resetval="0x0" description="Capture Event 2 Status Flag. This flag is only active in CAP mode.    Read0   |   ECAP_INDICATE_NO_EVENTIndicates no event occurred      Read1   |   ECAP_INDICATE_2ND_EVENT_ECAPXIndicates the second event occurred at ECAPx pin.  " range="2" rwaccess="RO"/> 
		<bitfield id="CEVT1" width="1" begin="1" end="1" resetval="0x0" description="Capture Event 1 Status Flag. This flag is only active in CAP mode.    Read0   |   ECAP_INDICATE_NO_EVENTIndicates no event occurred      Read1   |   ECAP_INDICATE_1ST_EVENT_ECAPXIndicates the first event occurred at ECAPx pin.  " range="1" rwaccess="RO"/> 
		<bitfield id="INT" width="1" begin="0" end="0" resetval="0x0" description="Global Interrupt Status Flag    Read0   |   ECAP_INDICATE_NO_EVENTIndicates no event occurred      Read1   |   ECAP_INDICATE_INTERRUPTIndicates that an interrupt was generated.  " range="0" rwaccess="RO"/>
	</register>
