IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_ECAP3_CONTROLSS_ECAP3.xml
	<register id="CONTROLSS_ECAP3_ECAPSYNCINSEL" acronym="CONTROLSS_ECAP3_ECAPSYNCINSEL" offset="0x3C" width="32" description="">
		<bitfield id="SEL" width="7" begin="6" end="0" resetval="0x1" description="These bits determines the source of SYNCIN signal. 0x0 : Disabled using SOC tieoff. 0x7F : Refer to SOC spec for details." range="6 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP3_HRCTL" acronym="CONTROLSS_ECAP3_HRCTL" offset="0x40" width="32" description="">
		<bitfield id="CALIBCONT" width="1" begin="5" end="5" resetval="0x0" description="Continuous mode Calibration Select Bit: 0 Continuous mode disabled. 1 Continuous mode enabled. Calibration automatically restarts at end of current calibration cycle." range="5" rwaccess="RW"/> 
		<bitfield id="CALIBSTS" width="1" begin="4" end="4" resetval="0x0" description="Calibration status  Bit: 0 No active calibration cycle 1 Calibration cycle in progress" range="4" rwaccess="RO"/> 
		<bitfield id="CALIBSTART" width="1" begin="3" end="3" resetval="0x0" description="Calibration start  Bit: 0 No effect 1 Starts the calibration cycle" range="3" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="PRDSEL" width="1" begin="2" end="2" resetval="0x0" description="Calibration Period Match Select Bit: 0 Use SYSCLK Counter For Period Match (default at reset) 1 Reserved" range="2" rwaccess="RW"/> 
		<bitfield id="HRCLKE" width="1" begin="1" end="1" resetval="0x0" description="High Resolution Clock Enable Bit: 0 High resolution clock disabled (default at reset) 1 High resolution clock enabled. The clock should be enabled before enabling the high res function via the HRE bit." range="1" rwaccess="RW"/> 
		<bitfield id="HRE" width="1" begin="0" end="0" resetval="0x0" description="High Resolution Enable Bit: 0 High resolution mode disabled (default at reset) 1 High resolution mode enabled. Enabling this mode will connect the capture registers and edge event modes of the ECAP to be accessed by the High Res function.  Note: The High Res clock needs to be enabled (using the HRCLKE bit) first before enabling the module. Allow a certain start up stabilization period before enabling the module." range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP3_HRINTEN" acronym="CONTROLSS_ECAP3_HRINTEN" offset="0x48" width="32" description="">
		<bitfield id="CALPRDCHKSTS" width="1" begin="2" end="2" resetval="0x0" description="Calibration Period Check status Interrupt Enable:  0 Disable Calibration Period Check interrupt status 1 Enable Calibration Period Check interrupt status" range="2" rwaccess="RW"/> 
		<bitfield id="CALIBDONE" width="1" begin="1" end="1" resetval="0x0" description="Calibration done Interrupt Enable:  0 Disable Calibration done Interrupt  1 Enable Calibration done Interrupt" range="1" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP3_HRFLG" acronym="CONTROLSS_ECAP3_HRFLG" offset="0x4C" width="32" description="">
		<bitfield id="CALPRDCHKSTS" width="1" begin="2" end="2" resetval="0x0" description="Calibration period check status Flag Bit:  1 Indicates that calibration ended before PRDCHK due to overflow on one of the counters. 0 Indicates no event occurred.  Note: This bit remains latched until cleared by the user using the HRCLR [CALPRDCHKSTS] bit." range="2" rwaccess="RO"/> 
		<bitfield id="CALIBDONE" width="1" begin="1" end="1" resetval="0x0" description="Calibration Done Interrupt Flag Bit:  1 Indicates calibration cycle is completed 0 Indicates calibration cycle has not completed.  Note: This bit remains latched until cleared by the user using the HRCLR [CALIBDONE] bit." range="1" rwaccess="RO"/> 
		<bitfield id="CALIBINT" width="1" begin="0" end="0" resetval="0x0" description="Global calibration Interrupt Status Flag:  1 Indicates that an interrupt was generated from CALIBDONE or CALPRDCHKSTS. 0 Indicates no interrupt generated." range="0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ECAP3_HRCLR" acronym="CONTROLSS_ECAP3_HRCLR" offset="0x50" width="32" description="">
		<bitfield id="CALPRDCHKSTS" width="1" begin="2" end="2" resetval="0x0" description="Clear Calibration period check status Flag Bit:  1 Clears the CALPRDCHKSTS flag register bit. 0 No effect.  Note: H/W has priority over CPU writes if the user tries to clear a flag bit and an event occurs on the same cycle that tries to set the flag for the selected bit." range="2" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CALIBDONE" width="1" begin="1" end="1" resetval="0x0" description="Clear Calibration Done Interrupt Flag Bit:  1 Clears the CALIBDONE interrupt flag register bit. 0 No effect.  Note: H/W has priority over CPU writes if the user tries to clear a flag bit and an event occurs on the same cycle that tries to set the flag for the selected bit." range="1" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CALIBINT" width="1" begin="0" end="0" resetval="0x0" description="Clear Global calibration Interrupt Flag 1 Clears the Global interrupt flag and enables further interrupts to be generated if any of the event flags are set. 0 No effect." range="0" rwaccess="RW
	  			 RRETURNS0S"/>
	</register>
	<register id="CONTROLSS_ECAP3_HRFRC" acronym="CONTROLSS_ECAP3_HRFRC" offset="0x54" width="32" description="">
		<bitfield id="CALPRDCHKSTS" width="1" begin="2" end="2" resetval="0x0" description="Force CALPRDCHKSTS flag: 0 No effect 1 Sets the CALPRDCHKSTS flag." range="2" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="CALIBDONE" width="1" begin="1" end="1" resetval="0x0" description="Force CALIBDONE flag: 0 No effect 1 Sets the CALIBDONE flag." range="1" rwaccess="RW
	  			 RRETURNS0S"/>
	</register>
	<register id="CONTROLSS_ECAP3_HRCALPRD" acronym="CONTROLSS_ECAP3_HRCALPRD" offset="0x58" width="32" description="">
		<bitfield id="PRD" width="32" begin="31" end="0" resetval="0x4194303" description="Register to program calibration period. The period value is matched against HRSYSCLKCTR. On a match an interrupt is generated and the counter registers values are captured." range="31 - 0" rwaccess="RW"/>
	</register>
