IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_ECAP3_CONTROLSS_ECAP3.xml
	<register id="CONTROLSS_ECAP3_HRSYSCLKCTR" acronym="CONTROLSS_ECAP3_HRSYSCLKCTR" offset="0x5C" width="32" description="">
		<bitfield id="HRSYSCLKCTR" width="32" begin="31" end="0" resetval="0x0" description="Current SYSCLK counter value" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ECAP3_HRSYSCLKCAP" acronym="CONTROLSS_ECAP3_HRSYSCLKCAP" offset="0x60" width="32" description="">
		<bitfield id="HRSYSCLKCAP" width="32" begin="31" end="0" resetval="0x0" description="HRSYSCLKCTR is captures into this register at end of calibration cycle." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ECAP3_HRCLKCTR" acronym="CONTROLSS_ECAP3_HRCLKCTR" offset="0x64" width="32" description="">
		<bitfield id="HRCLKCTR" width="32" begin="31" end="0" resetval="0x0" description="Current HRCLK counter value  Note: HRCLK is  not  synchronized to SYSCLK domain so reads may not be accurate" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ECAP3_HRCLKCAP" acronym="CONTROLSS_ECAP3_HRCLKCAP" offset="0x68" width="32" description="">
		<bitfield id="HRCLKCAP" width="32" begin="31" end="0" resetval="0x0" description="HRCLKCTR is captures into this register at end of calibration cycle.  Note: HRCLK is  not  synchronized to SYSCLK domain so reads may not be accurate" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ECAP3_HRDEBUGCTL" acronym="CONTROLSS_ECAP3_HRDEBUGCTL" offset="0x74" width="32" description="">
		<bitfield id="OBSERVE_SRC_SEL" width="4" begin="11" end="8" resetval="0x0" description="Select bits for selecting source for OBSERVE1 and OBSERVE2 registers 1000 HROUTH and HROUTL will read HR1OUT 1001 HROUTH and HROUTL will read HR2OUT 1010 HROUTH and HROUTL will read Capture Delayline 1 OBS1 1011 HROUTH and HROUTL will read Capture Delayline 2 OBS1 1100 HROUTH and HROUTL will read Capture Delayline 1 OBS2 1101 HROUTH and HROUTL will read Capture Delayline 2 OBS2" range="11 - 8" rwaccess="RW"/> 
		<bitfield id="CALIB_INPUT_SEL" width="2" begin="5" end="4" resetval="0x0" description="Select bit for calibration input, can be used to get fault coverage using these inputs 00 CAPIN is one of 128 inputs selected by INPUTSEL 01 CAPIN is connected to CAPIN_MEMMAP_SOURCE 10 CAPIN is internally generated signal waveform with 8*HRCLK cycle high and 8*HRCLK cycle low, used for linearity check of capture delay line 1 11 CAPIN is internally generated signal waveform with 8*HRCLK cycle high and 8*HRCLK cycle low, delayed by half HRCLK, used for linearity check of capture delay line 2" range="5 - 4" rwaccess="RW"/> 
		<bitfield id="CAPIN_MMAP_SOURCE" width="1" begin="2" end="2" resetval="0x0" description="Memory mapped CAPIN source Note : select CALIN source first, it may happen that you may see interrupt if MMAP source is different from current value of CAPIN. This is debug feature hence no additional HW is necessary to prevent this." range="2" rwaccess="RW"/> 
		<bitfield id="DELAYRESETDLINE" width="1" begin="1" end="1" resetval="0x0" description="Controls the reset delayline timing 0 reset is forced on next falling edge of HRCLK (1/2 cycle after capture) 1 reset is applied a cycle later (1 1/2 cycles after capture)" range="1" rwaccess="RW"/> 
		<bitfield id="DISABLEINVSEL" width="1" begin="0" end="0" resetval="0x0" description="Disable INVSEL Logic: 0 State machine controls inversion on input signal 1 CAPIN signal propagated into delay line without inversion, this means only rising edges can be measured" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP3_HRDEBUGOBSERVE1" acronym="CONTROLSS_ECAP3_HRDEBUGOBSERVE1" offset="0x78" width="32" description="">
		<bitfield id="HROUTH" width="32" begin="31" end="0" resetval="0x0" description="Reads raw output of HROUT capture delay line 1" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ECAP3_HRDEBUGOBSERVE2" acronym="CONTROLSS_ECAP3_HRDEBUGOBSERVE2" offset="0x7C" width="32" description="">
		<bitfield id="HROUTL" width="32" begin="31" end="0" resetval="0x0" description="Reads raw output of HROUT capture delay line 2" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ECAP3_MUNIT_COMMON_CTL" acronym="CONTROLSS_ECAP3_MUNIT_COMMON_CTL" offset="0x80" width="32" description="">
		<bitfield id="GLDSTRBSEL" width="7" begin="14" end="8" resetval="0x0" description="Global load strobe select to enable shadow to active loading 0x0 : Disabled with SOC level tieoff. 0x1 to 0x7F : Global load strobe from SOC level including ETPWM global load strobes." range="14 - 8" rwaccess="RW"/> 
		<bitfield id="TRIPSEL" width="7" begin="6" end="0" resetval="0x0" description="Trip signal select to disable and enable signal monitoring automatically  0x0 : Disabled, Trip signals does not affect signal monitoring, achieved with SOC level tieoff. 0x1 to 0x7F : Signal monioring is disabled when selected signal is high and enabled when it is low" range="6 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP3_MUNIT_1_CTL" acronym="CONTROLSS_ECAP3_MUNIT_1_CTL" offset="0xC0" width="32" description="">
		<bitfield id="MON_SEL" width="4" begin="11" end="8" resetval="0x0" description="Type of monitoring  0 : High Pulse width  1 : Low Pulse width  2 : Period width from Rise to Rise  3 : Period width from fall to fall  4 : Monitor rise edge  5 : Monitor fall edge  6-15 : Reserved (High Pulse width)" range="11 - 8" rwaccess="RW"/> 
		<bitfield id="DEBUG_RANGE_EN" width="1" begin="1" end="1" resetval="0x0" description="Debug mode enable. 0 : Debug mode is disabled. 1 : Debug mode of monitoring unit 1 is enabled to obtain the variation seen in the system for debug purpose. Range is captured in MUNIT_1_DEBUG_RANGE_MIN and MUNIT_1_DEBUG_RANGE_MAX registers  Toggle DEBUG_RANGE_EN to restart this process, this will initialize MUNIT_1_DEBUG_RANGE_MIN and MUNIT_1_DEBUG_RANGE_MAX registers." range="1" rwaccess="RW"/> 
		<bitfield id="EN" width="1" begin="0" end="0" resetval="0x0" description="0 : Monitoring unit 1 is disabled 1 : Monitoring unit 1 is enabled" range="0" rwaccess="RW"/>
	</register>
